Partially fixed.

Resource defined as following
```
resource "opennebula_datastore" "system_datastore" {
  count = var.cluster_datastores

  name       = "${var.cluster_name}-${var.cluster_env}-${var.cluster_cpu_vendor}-ds${count.index + 1}"
  type       = "system"
#  cluster_id = opennebula_cluster.cluster.id

  custom {
    transfer  = "ssh"
  }
}
```

On the 1st run the resource is created
```
  # module.vhgate_dev_intel.opennebula_datastore.system_datastore[1] will be created
  + resource "opennebula_datastore" "system_datastore" {
      + cluster_id             = (known after apply)
      + clusters               = (known after apply)
      + default_tags           = (known after apply)
      + driver                 = (known after apply)
      + id                     = (known after apply)
      + name                   = "vhgate-dev-intel-ds2"
      + restricted_directories = (known after apply)
      + safe_directories       = (known after apply)
      + tags_all               = (known after apply)
      + type                   = "system"

      + custom {
          + transfer = "ssh"
        }
    }
```

On the second run the resource tryed to be replaced.

```
  # module.vhgate_dev_intel.opennebula_datastore.system_datastore[1] must be replaced
-/+ resource "opennebula_datastore" "system_datastore" {
      ~ clusters               = [
          - 168,
        ] -> (known after apply)
      ~ default_tags           = {} -> (known after apply)
      + driver                 = (known after apply)
      ~ id                     = "312" -> (known after apply)
        name                   = "vhgate-dev-intel-ds2"
      ~ restricted_directories = "/" -> (known after apply)
      ~ safe_directories       = "/var/tmp" -> (known after apply)
      ~ tags_all               = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      + custom { # forces replacement
          + transfer = "ssh"
        }
      - custom { # forces replacement
          - datastore = "-" -> null
          - transfer  = "ssh" -> null
        }
    }

```

As per the manual, the datastore should not be specified on type SYSTEM.

I allso tried to specify it as - or null with no success.